In [ ]:
step1- select database name company 
step2- right click on the database name company 
step3 - SELECT * FROM employee;  run this commant and see last time created table .

In [ ]:

SELECT * FROM employee; # THIS COMMAND FOR SHOWIND THE DATA AND OUTPUT


INSERT INTO employee(name, postion , department, hire_date, salary)    #This command for add the data in the rows
            VALUES
			('Arvind Dhage','Data Analyst','Data Science ','2024-05-15',56000.00),  
			('Priya Desai', 'Software Engineer', 'IT', '2021-09-20', 75000.00),
            ('Rajesh Kumar', 'HR Manager', 'Human Resources', '2019-03-10', 82000.00),
            ('Sneha Patel', 'Marketing Specialist', 'Marketing', '2020-11-25', 58000.00),
            ('Vikram Singh', 'Sales Executive', 'Sales', '2023-02-12', 62000.00); 

ALTER TABLE employee                #this command for update the data type
ALTER COLUMN salary TYPE NUMERIC(12, 2);

TRUNCATE TABLE employee;                        this command for delet all the rows in the database company 
TRUNCATE TABLE employee RESTART IDENTITY;